app/views/posts/_form.html.erb

      <%= f.label "Categories" %>
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |checkbox| %>
---
SELECT "categories".* FROM "categories"