app/views/posts/_post.html.erb

      <span>
        <%= link_to("#{post.comments.length} comments", post_path(post)) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]