app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 13 Mar 2017 04:27:10 UTC +00:00], ["name", "Gaming"], ["updated_at", Mon, 13 Mar 2017 04:27:10 UTC +00:00]]