app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    # @comment = @post.comments.buld(params.require(:comment).permit(:body)) # Same as lines 5-6
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post_id = params[:post_id]

    @comment.creator = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Hello"], ["created_at", Tue, 14 Mar 2017 01:50:04 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 14 Mar 2017 01:50:04 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    vote = Vote.create(voteable: comment, creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 16 Mar 2017 21:34:34 UTC +00:00], ["updated_at", Thu, 16 Mar 2017 21:34:34 UTC +00:00], ["user_id", 3], ["vote", true], ["voteable_id", 8], ["voteable_type", "Comment"]]