app/controllers/posts_controller.rb

  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 16 Mar 2017 21:02:49 UTC +00:00], ["updated_at", Thu, 16 Mar 2017 21:02:49 UTC +00:00], ["user_id", 3], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]