app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.creator = User.first # Hard coded for now, will change when we have authentication

    if @post.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "This is the first post"], ["updated_at", Mon, 13 Mar 2017 02:18:26 UTC +00:00]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]