app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params.require(:user).permit!)

    if @user.save

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["username", "tim-lee91"], ["updated_at", Wed, 15 Mar 2017 23:43:06 UTC +00:00]]
---
  def update
    if @user.update(params.require(:user).permit!)